backend: tensorflow
class_name: Sequential
config:
  build_input_shape: !!python/object/apply:builtins.dict
  - f1: !!python/tuple
    - null
    - 1
    f10: !!python/tuple
    - null
    - 1
    f11: !!python/tuple
    - null
    - 1
    f12: !!python/tuple
    - null
    - 1
    f13: !!python/tuple
    - null
    - 1
    f14: !!python/tuple
    - null
    - 1
    f15: !!python/tuple
    - null
    - 1
    f16: !!python/tuple
    - null
    - 1
    f17: !!python/tuple
    - null
    - 1
    f18: !!python/tuple
    - null
    - 1
    f19: !!python/tuple
    - null
    - 1
    f2: !!python/tuple
    - null
    - 1
    f20: !!python/tuple
    - null
    - 1
    f21: !!python/tuple
    - null
    - 1
    f22: !!python/tuple
    - null
    - 1
    f23: !!python/tuple
    - null
    - 1
    f24: !!python/tuple
    - null
    - 1
    f25: !!python/tuple
    - null
    - 1
    f26: !!python/tuple
    - null
    - 1
    f27: !!python/tuple
    - null
    - 1
    f28: !!python/tuple
    - null
    - 1
    f29: !!python/tuple
    - null
    - 1
    f3: !!python/tuple
    - null
    - 1
    f30: !!python/tuple
    - null
    - 1
    f31: !!python/tuple
    - null
    - 1
    f32: !!python/tuple
    - null
    - 1
    f33: !!python/tuple
    - null
    - 1
    f34: !!python/tuple
    - null
    - 1
    f35: !!python/tuple
    - null
    - 1
    f36: !!python/tuple
    - null
    - 1
    f37: !!python/tuple
    - null
    - 1
    f38: !!python/tuple
    - null
    - 1
    f39: !!python/tuple
    - null
    - 1
    f4: !!python/tuple
    - null
    - 1
    f40: !!python/tuple
    - null
    - 1
    f41: !!python/tuple
    - null
    - 1
    f42: !!python/tuple
    - null
    - 1
    f43: !!python/tuple
    - null
    - 1
    f44: !!python/tuple
    - null
    - 1
    f45: !!python/tuple
    - null
    - 1
    f46: !!python/tuple
    - null
    - 1
    f47: !!python/tuple
    - null
    - 1
    f48: !!python/tuple
    - null
    - 1
    f5: !!python/tuple
    - null
    - 1
    f6: !!python/tuple
    - null
    - 1
    f7: !!python/tuple
    - null
    - 1
    f8: !!python/tuple
    - null
    - 1
    f9: !!python/tuple
    - null
    - 1
  layers:
  - class_name: DenseFeatures
    config:
      dtype: float32
      feature_columns:
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f1
          normalizer_fn: null
          shape: &id001 !!python/tuple
          - 1
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f10
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f11
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f12
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f13
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f14
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f15
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f16
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f17
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f18
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f19
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f2
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f20
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f21
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f22
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f23
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f24
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f25
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f26
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f27
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f28
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f29
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f3
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f30
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f31
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f32
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f33
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f34
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f35
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f36
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f37
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f38
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f39
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f4
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f40
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f41
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f42
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f43
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f44
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f45
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f46
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f47
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f48
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f5
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f6
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f7
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f8
          normalizer_fn: null
          shape: *id001
      - class_name: NumericColumn
        config:
          default_value: null
          dtype: float32
          key: f9
          normalizer_fn: null
          shape: *id001
      name: dense_features_116
      partitioner: null
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_11
      trainable: true
      units: 64
      use_bias: true
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_12
      trainable: true
      units: 128
      use_bias: true
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_13
      trainable: true
      units: 64
      use_bias: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_14
      trainable: true
      units: 128
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_3
      noise_shape: null
      rate: 0.1
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_15
      trainable: true
      units: 1
      use_bias: true
  name: sequential_3
keras_version: 2.4.0
